# Напишите программу, которая определит позицию 
# второго вхождения строки в списке либо сообщит, 
# что её нет.
# *Пример:*
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1


def isFindString(list, str):
    sum = 0
    for i in range(len(list)):
        if list[i] == str:
            sum += 1
        if sum == 2:
            return i
    return -1

list = ["123", "234", 123, "567"]
stroka = "qwe"
print(isFindString(list, stroka))